In [1]:
import pandas as pd
import numpy as np

In [2]:
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"
df = pd.read_csv(url, sep="|")
df.head(5)

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [4]:
# set index to user_id
df.set_index('user_id',inplace=True)
df.head(5)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [5]:
df.tail(5)

         age gender     occupation zip_code
user_id
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [7]:
# number of observation 
print("the number of observation is {}".format(df.shape[0])) 
print("the number of columns is {}".format(df.shape[1]))

the number of observation is 943
the number of columns is 4

In [8]:
# all columns
df.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [9]:
# how is the dataset indexed
df.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [10]:
# type of each column
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
zip_code      943 non-null object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [11]:
df.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [12]:
df['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [14]:
# how many different occupation in the dataset
a = df.groupby(['occupation']).sum()
print("the number of occupation in our dataset is {}".format(a.shape[0]))

the number of occupation in our dataset is 21

In [15]:
#other methods
df['occupation'].nunique()

21

In [17]:
#other one
df['occupation'].value_counts().count()

21

In [25]:
# the most frequent occupation
df['occupation'].value_counts().sort_values(ascending=False).index[0]

'student'

In [26]:
# summarize the dataframe
df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [28]:
# as you can see by default only the numeric columns are returned
# if we want to display all column 
df.describe(include="all")

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [29]:
#specify the column to be summarized
df['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [31]:
# mean age of user
round(df['age'].mean())

34.0

In [33]:
# the age with the least occurrence
df['age'].value_counts().sort_values(ascending=True)

7      1
11     1
66     1
73     1
10     1
      ..
27    35
28    36
22    37
25    38
30    39
Name: age, Length: 61, dtype: int64